recursos/xml/ReqGenerarDocumentoDesembolso.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://www.davivienda.com/SrvScnGenerarDocumentoDesembolso/v1" xmlns:v11="http://www.davivienda.com/Esquemas/Framework/ContextoSolicitudTipo/v1" xmlns:v12="http://www.davivienda.com/Esquemas/Framework/ServicioTipo/v1" xmlns:v13="http://www.davivienda.com/Esquemas/Framework/OperacionCanalTipo/v1" xmlns:v14="http://www.davivienda.com/Esquemas/Framework/ConsumidorTipo/v1" xmlns:v15="http://www.davivienda.com/Esquemas/Framework/AplicacionTipo/v1" xmlns:v16="http://www.davivienda.com/Esquemas/Framework/CanalTipo/v1" xmlns:v17="http://www.davivienda.com/Esquemas/Framework/TerminalTipo/v1" xmlns:v18="http://www.davivienda.com/Esquemas/Framework/HuellaDigitalDispositivoTipo/v1" xmlns:v19="http://www.davivienda.com/Esquemas/Framework/CriterioOrdenamientoTipo/v1" xmlns:v110="http://www.davivienda.com/Esquemas/Framework/PaginacionTipo/v1">
   <soapenv:Header/>
   <soapenv:Body>
      <v1:msjSolOpGenerarDocumentoDesembolso>
         <v1:contextoSolicitud>
            <v11:servicio>
               <v12:idServicio>?</v12:idServicio>
            </v11:servicio>
            <v11:operacionCanal>
               <v13:idSesion>?</v13:idSesion>
               <v13:idTransaccion>?</v13:idTransaccion>
               <v13:fecOperacion>?</v13:fecOperacion>
               <v13:valJornada>?</v13:valJornada>
               <v13:codMoneda>?</v13:codMoneda>
               <v13:codPais>?</v13:codPais>
               <v13:codIdioma>?</v13:codIdioma>
            </v11:operacionCanal>
            <v11:consumidor>
               <v14:idConsumidor>?</v14:idConsumidor>
               <v14:aplicacion>
                  <v15:idAplicacion>?</v15:idAplicacion>
               </v14:aplicacion>
               <v14:canal>
                  <v16:idCanal>?</v16:idCanal>
                  <v16:idHost>?</v16:idHost>
               </v14:canal>
               <v14:terminal>
                  <v17:idTerminal>?</v17:idTerminal>
                  <v17:valOrigenPeticion>?</v17:valOrigenPeticion>
                  <v17:codUsuario>?</v17:codUsuario>
                  <v17:valPerfil>?</v17:valPerfil>
               </v14:terminal>
            </v11:consumidor>
            <!--Optional:-->
            <v11:huellaDigitalDispositivo>
               <!--Optional:-->
               <v18:idBeacon>?</v18:idBeacon>
               <!--Optional:-->
               <v18:valHuellaDispositivo>?</v18:valHuellaDispositivo>
               <!--Optional:-->
               <v18:valTokenCookie>?</v18:valTokenCookie>
               <!--Optional:-->
               <v18:valTokenFSO>?</v18:valTokenFSO>
               <!--Optional:-->
               <v18:valHttpAccept>?</v18:valHttpAccept>
               <!--Optional:-->
               <v18:valHttpAcceptChars>?</v18:valHttpAcceptChars>
               <!--Optional:-->
               <v18:valHttpAcceptEncoding>?</v18:valHttpAcceptEncoding>
               <!--Optional:-->
               <v18:valHttpAcceptLanguage>?</v18:valHttpAcceptLanguage>
               <!--Optional:-->
               <v18:valHttpReferrer>?</v18:valHttpReferrer>
               <!--Optional:-->
               <v18:valIpAddress>?</v18:valIpAddress>
               <!--Optional:-->
               <v18:valUserAgent>?</v18:valUserAgent>
            </v11:huellaDigitalDispositivo>
            <v11:criteriosOrdenamiento>
               <!--Zero or more repetitions:-->
               <v11:criterioOrdenamiento>
                  <!--Optional:-->
                  <v19:valColumna>?</v19:valColumna>
                  <!--Optional:-->
                  <v19:valOrden>?</v19:valOrden>
               </v11:criterioOrdenamiento>
            </v11:criteriosOrdenamiento>
            <!--Optional:-->
            <v11:paginacion>
               <!--Optional:-->
               <v110:valCantidadRegistrosLote>?</v110:valCantidadRegistrosLote>
               <!--Optional:-->
               <v110:valNumeroLote>?</v110:valNumeroLote>
               <!--Optional:-->
               <v110:valTotalRegistros>?</v110:valTotalRegistros>
            </v11:paginacion>
         </v1:contextoSolicitud>
         <v1:data>
            <!--Optional:-->
            <v1:consultarPagare>
               <v1:producto>
                  <!--Optional:-->
                  <v1:codProducto>?</v1:codProducto>
                  <!--Optional:-->
                  <v1:codSubproducto>?</v1:codSubproducto>
                  <!--Optional:-->
                  <v1:valTipoProducto>?</v1:valTipoProducto>
                  <!--Optional:-->
                  <v1:valCompania>?</v1:valCompania>
                  <!--Optional:-->
                  <v1:descProducto>?</v1:descProducto>
                  <!--Optional:-->
                  <v1:codVinculacion>?</v1:codVinculacion>
                  <!--Optional:-->
                  <v1:valAliasProducto>?</v1:valAliasProducto>
                  <!--Optional:-->
                  <v1:valNumeroProducto>?</v1:valNumeroProducto>
                  <!--Optional:-->
                  <v1:valVigencia>?</v1:valVigencia>
               </v1:producto>
               <!--Optional:-->
               <v1:codigoDepositante>
                  <!--Optional:-->
                  <v1:codigoDepositante>?</v1:codigoDepositante>
               </v1:codigoDepositante>
               <!--Optional:-->
               <v1:consultaPagareService>
                  <!--Optional:-->
                  <v1:idEstadoPagare>?</v1:idEstadoPagare>
                  <!--Optional:-->
                  <v1:codigoDeceval>?</v1:codigoDeceval>
                  <!--Optional:-->
                  <v1:numPagareEntidad>?</v1:numPagareEntidad>
                  <!--Optional:-->
                  <v1:idTipoIdentificacionFirmante>?</v1:idTipoIdentificacionFirmante>
                  <!--Optional:-->
                  <v1:numIdentificacionFirmante>?</v1:numIdentificacionFirmante>
               </v1:consultaPagareService>
            </v1:consultarPagare>
            <!--Optional:-->
            <v1:generarPaquete>
               <v1:paqueteDocId>?</v1:paqueteDocId>
               <v1:cliente>
                  <v1:valTipoIdentificacion>?</v1:valTipoIdentificacion>
                  <v1:valNumeroIdentificacion>?</v1:valNumeroIdentificacion>
                  <!--Optional:-->
                  <v1:valMail>?</v1:valMail>
               </v1:cliente>
               <v1:listaParametros>
                  <!--1 to 300 repetitions:-->
                  <v1:valParametro id="?" valor="?"/>
                  <!--1 to 300 repetitions:-->
                  <v1:parametroTabla>
                     <v1:valIdTabla>?</v1:valIdTabla>
                     <v1:columnas>
                        <!--1 to 300 repetitions:-->
                        <v1:valNombreColumna>?</v1:valNombreColumna>
                     </v1:columnas>
                     <!--Optional:-->
                     <v1:registros>
                        <!--1 to 200 repetitions:-->
                        <v1:registro>
                           <!--1 to 200 repetitions:-->
                           <v1:valParametro id="?" valor="?"/>
                        </v1:registro>
                     </v1:registros>
                  </v1:parametroTabla>
                  <!--1 to 300 repetitions:-->
                  <v1:adjunto>
                     <v1:valNombre>?</v1:valNombre>
                     <v1:valContenido>cid:1438607187112</v1:valContenido>
                     <v1:valTipo>?</v1:valTipo>
                  </v1:adjunto>
               </v1:listaParametros>
               <v1:enviarCopiaCorreo>?</v1:enviarCopiaCorreo>
               <v1:requiereClave>?</v1:requiereClave>
               <!--Optional:-->
               <v1:valClaveDocumento>?</v1:valClaveDocumento>
            </v1:generarPaquete>
            <!--Optional:-->
            <v1:Estado>?</v1:Estado>
         </v1:data>
      </v1:msjSolOpGenerarDocumentoDesembolso>
   </soapenv:Body>
</soapenv:Envelope>